app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function authenticate()
    {
        // Mengambil input dari form login
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Validate inputs
        if (empty($username) || empty($password)) {
            session()->setFlashdata('error', 'Username dan password harus diisi');
            return redirect()->back()->withInput();
        }

        // Inisialisasi model User
        $userModel = new UserModel();

        // Mencari user berdasarkan username
        $user = $userModel->where('username', $username)->first();