app/Controllers/Home.php

    public function index()
    {
        // Mengecek apakah user sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Inisialisasi model Employee
        $employeeModel = new EmployeeModel();

        // Mengambil semua data dari tabel employees
        $data['employees'] = $employeeModel->findAll();
---
SELECT *
FROM `employees`